[
  {
    "path": "posts/2021-03-23-eda/",
    "title": "Exploratory Data Analysis",
    "description": "Exploratory data analysis forms the first component of the Shiny application on the prediction of whether an indiviudal would take the H1N1 vaccine. Its role is to give users of the application introductory insights into the relationship between input variables and the target variable, before the user proceeds to the other components of the Shiny application on explanatory and predictive models.",
    "author": [
      {
        "name": "TAY Kai lin",
        "url": "https://www.linkedin.com/in/kai-lin-tay/"
      }
    ],
    "date": "2021-03-23",
    "categories": [],
    "contents": "\r\n1 Literature Review\r\n1.1 Approach to Literature Review\r\nLiterature review was conducted to analyze how Exploratory Data Analysis (EDA) has been performed before, and whether those techniques are applicable to the project on the explanatory and predictive modeling of whether an individual is likely to undergo H1N1 vaccination. In view of the scope of the project that covers explanatory and predictive modeling, the objective of the EDA is to visualize the relationships between input variables and the target variable so as to identify any trends which may suggest the usefulness of an input variable in predicting the target variable.\r\nA key consideration in deciding the type of visualization is the data type of the input variables. For this dataset, most of the input variables are categorical. Therefore, visualizations that are suitable for categorical variables will be explored, as opposed to visualization that are suitable for continuous variables such as correlation plots and histograms.\r\n1.2 Reviewing Past Visualizations on H1N1 vaccination or related topics\r\nMany descriptive visualizations have been made to visualize survey responses on attitudes towards H1N1 vaccination before, or related public health topics on other pandemics. Some examples have been highlighted below:\r\nDistribution of survey responses\r\nAn example of a visualization is responses of survey respondents on a scale of Strongly Disagree to Strongly Agree with respect to various statements, and how these proportions have changed over time. The visualization is available at this link and a screenshot is provided below:\r\n\r\nFigure 1: Visualization of how the distribution of survey responses to several statements related to Covid-19 and/or the vaccine have changed over time\r\nGeospatial distribution of Survey Responses\r\nAnother example of a visualization is a global map visualizing how the proportions of survey respondents who Strongly Agree or Agree with the statement that ‘Vaccines are imporant for children to have’. The visualization is available at this link and a screenshot is provided below:\r\n\r\nFigure 2: Geospatial visualization on survey responses of the percentage that ‘Agree’ and ‘Strongly Agree’ that vaccines are important for children\r\nHowever, these visualizations are not the most relevant for this project. While this dataset also involves survey responses, the objective of the visualization is not to gain insights on the survey responses alone but to gain insights on how the survey responses influence whether an individual takes the H1N1 vaccination. Therefore, I will not be following what these visualization have done, but look at other methods that can be used to explore the relationship between an input and target variable.\r\n1.3 Mosaic Plot\r\nThe mosaic plot data visualization technique is suitable for visualizing multivariate categorical data. A mosaic plot is a graphical display of cell frequencies in a contingency table, which is useful in this project where we are looking at how each input variable affects the target variable.\r\nWhile there are many packages that can be used for mosaic plots including ggmosaic and dlookr which contains plot.relate(), I will be using the vcd package. vcd stands for visualizing categorical data. ggmosaic, dlookr and vcd are all able to plot the basic requirements of a mosaic chart - which is to plot 2 categorical variables against each other and modify the aesthetics of the graph (e.g. color scheme) as required. However, the vcd package stands out for its shade function, where it is able to shade the mosaic plot based on chi-square test results. This color scale would be a useful indicator for this project in helping the user observe which input variables have a relationship with the target variable, and provides early insights into which input variables might be included or excluded in the explanatory and predictive models.\r\nHowever, a disadvantage of the mosaic plot is that rectangles can vary considerably in aspect ratio. As it is difficult to compare rectangles of different length and width, a user may not be able to compare the frequencies of the rectangles. To overcome this difficulty, a bar plot can be used in conjunction with the mosaic plot.\r\n1.4 Stacked Bar Chart\r\nBar plots are also a suitable data visualization technique for visualizing multivariate categorical data by helping us to identify the relationship between the input and target variables. For this project, we will be using a stacked bar chart which will clearly illustrate the different bars for those who have taken the vaccine and those who have not. With the bar charts, labels will be added to show the count and proportions of those who have and have not taken vaccine within each group (see below for more details). In addition, it can also help us to observe the distribution of the input variables with respect to the target variable, and whether there are any plots with complete or quasi-complete separation. Variables with complete or quasi-complete separation need to be removed from the logistic regression.\r\nWhile there are also many packages that can be used for bar charts, the package that I will be using is ggplot. The ggplot package is easy to manipulate and there are many different elements that we can add to the graph according to what is required. Aside from ggplot, other ways to plot barplots in R include R’s barplot() and barplot3d package. Barplot3d package is intended for 3d barplot, which I would not be exploring in this visualization. R’s barplot() offers similar functions to ggplot and can be used to do up simple barplots, but as a whole ggplot is a package with many more functions. Thus, ggplot is chosen.\r\n1.5 Other techniques for multivariate categorical data\r\nThere are other exploratory visualizations that we can explore for multivariate categorical data namely balloon plots, which can be plotted using ‘ggballoonplot()’ under ggpubr and correspondance analysis, which can be plotted using ’ca()’under the package FactoMineR. However, both of these plots will not be explored in this visualization. Most of the categorical variables in this visualization are binary and do not require balloon plots nor correspondance analysis which may be more suitable for categorical variables that have many categories.\r\nApart from visualizations, the contingency table is another commonly used technique for multivariate categorical data. There are many packages that are available for displaying tables including KableExtra, flextable, huxtable and reactable among many others. However, I will not need a contingency table as I will be including information on count in the bar chart.\r\n2 Storyboard\r\nCombining both elements of a mosaic plot and bar chart together, a storyboard has been sketched out as follows:\r\n\r\nFigure 3: Sketch of storyboard\r\nAs the objective of this visualization is to visualize the relationship between input variables and the target variable, the top section of the storyboard aims to achieve this objective through the mosaic plot and bar chart. By selecting a variable in the left panel, the variable will be plotted against the target variable in the main panel. In addition, it may be interested to investigate if there are relationships between input variables, which the bottom section aims to achieve. Upon selecting both variables in the left panel, both variables would appear in the main panel.\r\n3 Data Extraction and Preparation\r\n3.1 Installing packages\r\nThe first step would be to install the required packages. The packages that I will be using are as follows:\r\nPackage\r\nPurpose\r\ntidyverse\r\nData manipulation and plotting bar chart\r\nvcd and vcdExtra\r\nPlotting mosaic plot\r\nscales\r\nDisplaying the proportions in the bar chart\r\nstringr\r\nRecoding the values in the column ‘State’ into letters where the first letter is capitalized\r\nThe code for installing the packages is as follows:\r\n\r\n\r\npackages = c('tidyverse', 'vcd', 'vcdExtra', 'scales', 'stringr')\r\nfor (p in packages){\r\n  if(!require(p, character.only = T)){\r\n    install.packages(p)\r\n  }\r\n  library(p, character.only = T)\r\n}\r\n\r\n\r\n\r\n3.2 Importing dataset\r\nThe following line of code can be used to import the dataset.\r\n\r\n\r\nH1N1 <- read_csv(\"data/H1N1_Final_dan_edit.csv\")\r\n\r\n\r\n\r\n3.3 Data preparation\r\nThere are a few steps that we can take to prepare the data.\r\nThe first step is to rename the column for ‘Concern Level’. This is a problem that is specific to our dataset. As Concern Level has a whitespace character, there may be difficulties in calling this variable in subsequent codes. Thus, we rename it as ‘Concern_Level’.\r\n\r\n\r\nnames(H1N1)[names(H1N1) == 'CONCERN LEVEL'] <- \"CONCERN_LEVEL\"\r\n\r\n\r\n\r\nThe second step is to handle NA values. We handle NA values differently for the target variable and input variables. For the target variable, we would remove NA values as these rows are not useful to our analysis. The code is as follows:\r\n\r\n\r\n#exclude the NA column in the target variable\r\nH1N1 <- H1N1 %>%\r\n  filter(!is.na(VACC_H1N1_F))\r\n\r\n\r\n\r\nHowever, for input variables, it is acceptable to have NA values as long as these values are not above a certain threshold, which we have set as 50%. To select the input variables that have less than 50% of NA values, there are a few steps involved. The first step is to recode the NA values into NA as recognized by R. This is because the NA values in the dataset are coded as #N/A which is not recognized as an NA value to R. The following code can be run for this recoding process:\r\n\r\n\r\nH1N1[H1N1 == '#N/A'] <- NA\r\n\r\n\r\n\r\nNext, we can view a summary of the proportion of NA values in every column, the following code can be run:\r\n\r\n\r\ncolMeans(is.na(H1N1))\r\n\r\n\r\n\r\nFinally, we can select out the variables that have a missing value threshold of less than 50%. The following code can be run:\r\n\r\n\r\nh1n1data <-H1N1 %>%\r\n  select(VACC_H1N1_F, VACC_SEAS_F, B_H1N1_ANTIV, B_H1N1_AVOID, B_H1N1_FMASK,\r\n         B_H1N1_HANDS, B_H1N1_LARGE, B_H1N1_RCONT, B_H1N1_TOUCH, CONCERN_LEVEL,\r\n         INT_H1N1, KNOW_H1N1, INT_SEAS, DOCREC, CHRONIC_MED_F, CLOSE_UNDER6MO_F,\r\n         HEALTH_WORKER_F, PATIENT_CONTACT_F, AGEGRP, EDUCATION_COMP, HH_CHILD_R,\r\n         INC_CAT1, MARITAL, RACEETH4_I, N_ADULT_R, SEX_I, STATE)\r\n\r\n\r\n\r\nThe third step is to code the variables as categorical.\r\n\r\n\r\nh1n1data <- transform(h1n1data,\r\n                      VACC_H1N1_F= as.factor(VACC_H1N1_F),\r\n                      VACC_SEAS_F= as.factor(VACC_SEAS_F),\r\n                      B_H1N1_ANTIV= as.factor(B_H1N1_ANTIV),\r\n                      B_H1N1_AVOID= as.factor(B_H1N1_AVOID),\r\n                      B_H1N1_FMASK= as.factor(B_H1N1_FMASK),\r\n                      B_H1N1_HANDS= as.factor(B_H1N1_HANDS),\r\n                      B_H1N1_LARGE= as.factor(B_H1N1_LARGE),\r\n                      B_H1N1_RCONT= as.factor(B_H1N1_RCONT),\r\n                      B_H1N1_TOUCH= as.factor(B_H1N1_TOUCH),\r\n                      CONCERN_LEVEL= as.factor(CONCERN_LEVEL),\r\n                      INT_H1N1= as.factor(INT_H1N1),\r\n                      KNOW_H1N1= as.factor(KNOW_H1N1),\r\n                      DOCREC= as.factor(DOCREC),\r\n                      CHRONIC_MED_F= as.factor(CHRONIC_MED_F),\r\n                      CLOSE_UNDER6MO_F= as.factor(CLOSE_UNDER6MO_F),\r\n                      HEALTH_WORKER_F= as.factor(HEALTH_WORKER_F),\r\n                      AGEGRP= as.factor(AGEGRP),\r\n                      EDUCATION_COMP= as.factor(EDUCATION_COMP),\r\n                      HH_CHILD_R= as.factor(HH_CHILD_R),\r\n                      INC_CAT1= as.factor(INC_CAT1),\r\n                      MARITAL= as.factor(MARITAL),\r\n                      RACEETH4_I= as.factor(RACEETH4_I),\r\n                      N_ADULT_R= as.factor(N_ADULT_R),\r\n                      SEX_I= as.factor(SEX_I),\r\n                      STATE= as.factor(STATE),\r\n                      PATIENT_CONTACT_F = as.factor(PATIENT_CONTACT_F),\r\n                      INT_SEAS = as.factor(INT_SEAS)\r\n                   )\r\n\r\n\r\n\r\nThe fourth step is to create a new column for region based on the column in the dataset for state. To do so, we have another dataset that has columns for both region and state. We will start by importing this dataset with the following code:\r\n\r\n\r\nregion <- read_csv(\"data/state_region.csv\")\r\n\r\n\r\n\r\nThen, we will have to recode the values in the state column. This is because the values are currently all in uppercase letters. We will have to recode the letters into lowercase letters apart from the first letter. Finally, we can merge both tables using a left join.\r\n\r\n\r\nh1n1data$state_recoded <- str_to_title(h1n1data$STATE)\r\nh1n1data <- left_join(h1n1data, region,\r\n                      by=c(\"state_recoded\" = \"State\"))\r\n\r\n\r\n\r\n3.4 Overview of Variables\r\nAfter data preparation, the variables that I will be using are as follows:\r\nCategory\r\nVariable Name\r\nAllowable Values\r\nTarget Variable\r\nTaken H1N1 flu vaccine\r\nYes, No\r\nDemographic\r\nGender\r\nMale, Female\r\nDemographic\r\nAge Group\r\n6 months-9 years, 10-17 years, 18-34 years, 35-44 years, 45-54 years, 55-64 years, 65+ years\r\nDemographic\r\nEducation Level\r\n<12 years, 12 years, some college, college graduate\r\nDemographic\r\nIncome Level\r\n<=$10000, $10001-$15000, $15001-$25000, $25001-$35000, $35001-$50000, $50001-$75000, $75001-$100000\r\nDemographic\r\nMarital Status\r\nMarried, Not Married\r\nDemographic\r\nRace\r\nHispanic, Non-Hispanic Black Only, Non-Hispanic White Only, Non-Hispanic Other or Multiple Races\r\nDemographic\r\nNumber of children in household\r\n0, 1, 2, 3\r\nDemographic\r\nNumber of adults in household\r\n1, 2, 3, 4\r\nDemographic\r\nRegion\r\nNortheast Region, Midwest Region, South Region, West Region\r\nBehavioural\r\nTaken seasonal flu vaccine\r\nYes, No\r\nBehavioural\r\nTaken antiviral medications\r\nYes, No\r\nBehavioural\r\nAvoid close contact with others with flu-like symptoms\r\nYes, No\r\nBehavioural\r\nBought a face mask\r\nYes, No\r\nBehavioural\r\nWashing hands\r\nYes, No\r\nBehavioural\r\nReduced time at large gatherings\r\nYes, No\r\nBehavioural\r\nReduced contact outside home\r\nYes, No\r\nBehavioural\r\nAvoid touching eyes, nose or mouth\r\nYes, No\r\nAttitude\r\nConcern level about H1N1 flu\r\nNot at all concerned, not very concerned, somewhat concerned, very concerned\r\nAttitude\r\nIntent to get H1N1 flu vaccine\r\nDefinitely no intent, improbably intent, probable intent, definite intent\r\nAttitude\r\nKnowledge about H1N1 flu\r\nNo knowledge, a little knowledge, a lot of knowledge\r\nAttitude\r\nIntent to get seasonal flue vaccine\r\nDefinitely no intent, improbably intent, probable intent, definite intent\r\nAttitude\r\nDoctor recommendation on vaccines\r\nNever recommend vaccines, recommend seasonal flu vaccine only, recommend H1N1 vaccine only, recommend both seasonal flu and H1N1 flu vaccines\r\nRisk Factor\r\nChronic medical condition flag\r\nYes, No\r\nRisk Factor\r\nClose contact with child under 6 months flag\r\nYes, No\r\nRisk Factor\r\nWorks in healthcare field flag\r\nYes, No\r\nRisk Factor\r\nDirect patient contact flag\r\nYes, No\r\n4 Testing and Prototyping\r\nAs the storyboard contains mosaic plots and bar charts, this section will to test the codes for the plots and which kind of plots would work better for this project. While there are two sections in the storyboard, this prototype will focus on plotting a randomly chosen input variable against the target variable. The randomly chosen input variable is behavioural variable of whether the individual has bought a face mask. These codes can easily be replicated for other variables, and for the other section in the final Shiny application.\r\n4.1 Mosaic Plot\r\n4.1.1 Using Chi-Square Test for Shading\r\nStarting off on the mosaic plot, the first option is to use shading for the chi-square test plot. The color legend indicates which cells contribute to the significance of the chi-squared test results, and means the following:\r\nColor\r\nStatistical Significance\r\nRed\r\nThere are fewer observations than would have been expected under the null model\r\nBlue\r\nThere are more observations that would have been expected under the null mode\r\nThe colors imply that there is a relationship between the input variable and target variable. In this case, survey respondents who bought a face mask are more likely to have taken the H1N1 vaccine. The code and resultant plot are as follows:\r\n\r\n\r\nmosaic(~VACC_H1N1_F + B_H1N1_FMASK, data = h1n1data, shade = TRUE,\r\n       labeling_args = list(set_varnames = \r\n                              c(B_H1N1_ANTIV = \"Bought a Face Mask\", \r\n                                VACC_H1N1_F = \"Taken H1N1 vaccine\")))\r\n\r\n\r\n\r\n\r\nAs a contrast, the plot for gender is below, and is greyscale. This implies that gender is not a significant indicator of whether an individual takes the vaccine.\r\n\r\n\r\n\r\n4.1.2 Drawing attention to the desired outcome\r\nThe alternative option for shading is to draw attention to the desired outcome. However, in comparison with the mosaic plot in 4.1.1, this mosaic plot provides less useful information to the user as it does not display the chi-square test results. Therefore, we have decided to opt for the first mosaic plot. Nonetheless, the code and the resultant plot are as follows:\r\n\r\n\r\nmosaic(~VACC_H1N1_F + B_H1N1_FMASK, data = h1n1data, \r\n       labeling_args = list(set_varnames = \r\n                              c(VACC_H1N1_F = \"Taken H1N1 vaccine\", \r\n                                B_H1N1_FMASK = \"Bought a face mask\")),\r\n       shade = TRUE,\r\n       gp = gpar(fill=c('light grey', 'pink')))\r\n\r\n\r\n\r\n\r\n4.2 Bar Chart\r\nThe next plot that I will require is a stacked bar chart, which would require the code geom_bar() from the package ggplot2. There are several steps that we ned to take to produce the graph.\r\n4.2.1 Data Preparation\r\nThe first step is to drop the NA values in the columns using drop_NA(). Without dropping the NA values, these values would show up in the bar chart but do not offer much meaningful information to the user. Thus, I have decided to remove the NA values.\r\n4.2.2 Plotting the Graph\r\nThe basic function ggplot and geom_bar() can be used to plot the bar chart. As I am looking at creating a stacked bar chart for respondents who have taken the vaccine vs those who have not, the target variable can be used as the ‘fill’. While there are many themes that can be used, I have chosen to use the theme theme_classic().\r\n4.2.2.1 Plotting Data Labels of Frequency and Proportion\r\nTo provide comprehensive information to the user, I have decided to provide labels for both frequency and proportion.\r\nFor effective comparison on how the input variable affects the target variable, the proportion needs to be the count out of the sub-category within the target variable. To illustrate with the example of the input variable ‘Bought a Face Mask’, it will be more effective for users to compare that 32% of those who bought a face mask took the H1N1 vaccine vs a lower proportion of 21% of those who did not buy a face mask took the vaccine. This would highlight that there is a difference in proportion. Comparatively, it would be less insightful if the labels were a proportion of the total population i.e. 19% of the population were those who did not buy a face mask and took the vaccine vs 2% of the population were those who bought a face mask and took the vaccine. As differences in the proportions of the height of the stacked bar chart may not be obvious to the eye, the user would not be able to tell without further computations whether buying a face mask had an impact on whether an individual takes the vaccine.\r\nThe R code for the latter is much simpler and requires applying the geom_text() function to ..count.. / sum(..count..). However, the former requires a more complex formula to first compute the percentages using the package scales, and then plotting these values into geom_text(). Frequency and count were called in separate geom_text() functions.\r\n4.2.2.2 Colors\r\nTo draw attention to the respondents who have taken the vaccine as this is the desired outcome, I have colored those who have taken the vaccine in bright blue vs those who have not taken the vaccine which is in gray. To draw further attention to the desired outcome, I have included a black border.\r\nAs the values in the column for whether an individual took the H1N1 vaccine are coded as ‘Yes’ and ‘No’, I have also re-labelled the legened as ‘Took H1N1 vaccine’ and ‘Did not take H1N1 vaccine’ respectively. I have further titled the legend as ‘H1N1 vaccination’.\r\n4.2.2.3 Axis labels\r\nI have labelled the axes accordingly using xlab() and ylab(). To prevent the x-axis labels from overlapping each other when there are several categories in a variable, I have placed the labels diagonally as opposed to horizontally.\r\n4.2.3 Code and Final Plot\r\nThe resultant code and plot are as follows:\r\n\r\n\r\nVACC_H1N1_F.labs <- c(\"Did not take H1N1 vaccine\", \"Took H1N1 vaccine\")\r\nnames(VACC_H1N1_F.labs) <- c(\"No\", \"Yes\")\r\n\r\npercentData <- h1n1data %>% \r\n  drop_na(B_H1N1_FMASK) %>%\r\n  group_by(B_H1N1_FMASK) %>% \r\n  count(VACC_H1N1_F) %>%\r\n  mutate(ratio=scales::percent(n/sum(n)))\r\n\r\nh1n1data %>%\r\n  drop_na(B_H1N1_FMASK) %>%\r\n  ggplot(aes(x = B_H1N1_FMASK, fill = VACC_H1N1_F)) +\r\n  geom_bar(aes(color = VACC_H1N1_F == \"Yes\")) + \r\n  geom_text(data = percentData,\r\n            aes(y=n, label=paste(\"(\",ratio,\")\")),\r\n            size = 3,\r\n            position = position_stack(vjust = 0.5), hjust=-0.1) +\r\n  geom_text(stat = \"count\",\r\n            aes(label = ..count..),\r\n            size = 3,\r\n            position = position_stack(vjust = 0.5), hjust = 0.95) +\r\n  scale_fill_manual(values = c(\"#ECECEC\", \"#2a9df4\"),\r\n                    breaks = c(\"No\", \"Yes\"),\r\n                    labels = VACC_H1N1_F.labs,\r\n                    name = \"H1N1 Vaccination\",) + \r\n  scale_x_discrete(guide = guide_axis(angle = 45)) + \r\n  scale_color_manual(values = c(NA, 'black'), guide=F) +\r\n  xlab(\"Bought a face mask\") + \r\n  ylab(\"Frequency\") +\r\n  theme_classic()\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n",
    "preview": "posts/2021-03-23-eda/eda_files/figure-html5/unnamed-chunk-10-1.png",
    "last_modified": "2021-04-11T14:52:34+08:00",
    "input_file": "eda.utf8.md"
  },
  {
    "path": "posts/2021-02-23-proposal/",
    "title": "Group 5 Proposal",
    "description": "Below is our project proposal detail.",
    "author": [
      {
        "name": "Desmond LIM Pek Loong, HAI Dan, TAY Kai lin",
        "url": "https://example.com/norajones"
      }
    ],
    "date": "2021-02-23",
    "categories": [],
    "contents": "\nMotivation of the project\nWith the outbreak of Covid-19 and recent advancements in vaccination, an important task that public health authorities are looking into is increasing vaccination rates. This would entail looking into the factors that result in an individual undergoing vaccination and how to predict whether an individual would go for the vaccine.\nOur team is interested in drawing a parallel to another 21st century pandemic, the H1N1 virus, which is also known as the swine flu, that broke out in 2009. An extensive study had been conducted by the USA known as the National 2009 H1N1 Flu Survey (NHFS) into the demographics, attitudes towards H1N1 virus or the vaccine, and whether an individual had taken the H1N1 vaccine. This extensive dataset would not just allow us to perform descriptive analytics on how H1N1 vaccination rates vary in USA, but also allows us to do predictions on whether an individual would go for the vaccine.\nData Source\nThe source for our data is provided at the following link: https://www.cdc.gov/nchs/nis/data_files_h1n1.htm\nProblems or issues that the project will address\nThis project will address the following problems:\nDescriptive Analytics: How do vaccination rates vary across states in the USA?\nPredictive Analytics: How do we predict whether an individual would go for the H1N1 vaccine?\nProject Objectives\nThe project aims to use NFHS data to:\nVisualize vaccination receptivity in across states in US\nVisualize the relationships between vaccination and other variables.\nCreate predictive model of vaccination through Logistic regression, Decision tree and random forest\nProposed Scope and Methodology\nData Preparation\nData cleaning will be done using Excel and R. Excel is used as the first preliminary data cleaning to remove columns that will not be used and to combine binary columns into a single column. As for R, we will be using it to remove rows that have blanks for our target variables and to remove columns that have a proportion of blanks above a certain percentage.\nVisualization\nThe first page of the visualization would be our Map. In the Map, we would show how the survey responses and vaccination rates differ across various states in the USA.\nThe second page of the visualization would be our Exploratory Data Analysis (EDA). In our EDA, we will explore the factors that affect H1N1 vaccination. We will have visualizations for both a density plot and a multiplot. The density plot will help users visualize how every factor affects whether an individual would go for vaccination. Users can select the factors to be displayed on the correlation plot. The multiplot will help us to visualize the distribution of our target binary variable according to the factors in the survey. Users can select the factor that they wish to display on the visualization.\nThe third page of the visualization is our logistic regression. The fourth page will showcase the decision tree and random forest model.\nThe last page of the visualization is our Model Comparison.\nEarly prototypes or storyboards\nPage 1: Map\n\n\n\nPage 2: Exploratory Data Analysis (EDA) - Density Plot & Multiplot\n\n\n\nPage 3: Predictive Analytics\n\n\n\nPage 4: Decision Tree/Random Forest\nPage 5: Model Comparison\nR Packages to be used\nPackage Name\nDescription\nShiny and shinydashboard\nFor building interactive web applications with R\ndplyr\nFor effective data manipulation\nreadr\nFor reading excel files in R\nggplot2\nFor plotting various visualizations and EDA\ndlookr\nFor plotting various visualizations and EDA\nrpart\nTo perform recursive partitioning I.e. Decision Tree modelling\nrandomForest\nTo perform random forest modelling\nProject Timeline\n\n\n\nReferences\nComparison of the Logistic Regression, Decision Tree, and Random Forest Models to Predict Red Wine Quality in R: https://towardsdatascience.com/comparison-of-the-logistic-regression-decision-tree-and-random-forest-models-to-predict-red-wine-313d012d6953\nA COMPLETE GUIDE TO RANDOM FOREST IN R: https://www.listendata.com/2014/11/random-forest-with-r.html\nIntroduction to Random Forest in R: https://www.simplilearn.com/tutorials/data-science-tutorial/random-forest-in-r\nLogistic Regression in R: A Classification Technique to Predict Credit Card Default: https://blog.datasciencedojo.com/logistic-regression-in-r-tutorial/\n\n\n\n",
    "preview": "posts/2021-02-23-proposal/picture/1.jpg",
    "last_modified": "2021-03-30T15:04:43+08:00",
    "input_file": "proposal.utf8.md"
  },
  {
    "path": "posts/welcome/",
    "title": "Welcome to G5Project_ISSS602",
    "description": "Welcome to our new blog, G5Project_ISSS602. We hope you enjoy \nreading what we have to say!",
    "author": [
      {
        "name": "Nora Jones",
        "url": "https://example.com/norajones"
      }
    ],
    "date": "2021-02-23",
    "categories": [],
    "contents": "\n\n\n\n",
    "preview": {},
    "last_modified": "2021-02-23T09:26:31+08:00",
    "input_file": {}
  }
]
